Repository: nnworkz/AskMeNowBot
Catalog: resources/locale/*.resx
Languages: ru

# Error
source: *❌ There was an error*
ru: *❌ Произошла ошибка*

# FilteredOut
source: *❌ The text didn't pass the filters*
ru: *❌ Текст не прошел фильтры*

source: *Handling\.\.\.*
ru: *Обработка\.\.\.*

source: Add reason
ru: Добавить причину

source: Ban
ru: Заблокировать

# BillInfo
source: *🎫 {paymentName}* *Amount:* {amount} *Subscription until:* {expiresAt}
ru: *🎫 {paymentName}* *Сумма:* {amount} *Подписка до:* {expiresAt}

source: Cancel
ru: Отмена

# CannotUseOwnLink
source: *❌ You can't use your own link*
ru: *❌ Нельзя использовать собственную ссылку*

# ChooseChange
source: *🗳️ Choose what you want to change*
ru: *🗳️ Выберите, что хотите изменить*

source: *🔎 Command not found*
ru: *🔎 Команда не найдена*

source: Create link
ru: Создать ссылку

# Day
source: {price} for 1 day
ru: {price} за 1 день

# DecryptionFailed
source: *🧑🏻‍💻 Decryption failed: Invalid or corrupted data*
ru: *🧑🏻‍💻 Расшифровка не удалась: Неверные или поврежденные данные*

# EnterUserId
source: *✍️ Specify user ID in the command*
ru: *✍️ Укажите ID пользователя в команде*

# ExhaustedLimit
source: *🕐 You have reached your daily limit*
ru: *🕐 Вы исчерпали дневной лимит*

source: Extend subscription
ru: Продлить подписку

# HalfYear
source: {price} for 180 days
ru: {price} за 180 дней

source: *⚠️ Invalid link*
ru: *⚠️ Ссылка недействительна*

# IsBanned
source: *🚫 The user has blocked you* *Reason:* {reason}
ru: *🚫 Пользователь заблокировал вас* *Причина:* {reason}

source: *🔶 Invalid value*
ru: *🔶 Недопустимое значение*

# LinkName
source: *🔗 Your link information* > `t.me/{name}?start={link}` *Uses:* {used} *Max uses:* {maxUsages} *Active until:* {expiresAt} *{activated}*
ru: *🔗 Информация о вашей ссылке* > `t.me/{name}?start={link}` *Количество использований:* {used} *Максимальное количество использование*: {maxUsages} *Активен до:* {expiresAt} *{activated}*

source: Activated
ru: Активирован

source: Deactivated
ru: Деактивирован

# LinkToRecipient
source: *⚠️ Use the recipient's link to send them an anonymous message*
ru: *⚠️ Перейдите по ссылке получателя, чтобы отправить ему анонимное сообщение*

# MessageCooldown
source: *⌛ Wait {time} seconds before sending the next message*
ru: *⌛ Подождите {time} секунд перед отправкой следующего сообщения*

# MessageIsTooLong
source: *⚠️ Max message length: {length} characters*
ru: *⚠️ Максимальная длина сообщения: {length} символов*

# MessageSent
source: *📤 Your anonymous message has been sent*
ru: *📤 Ваше анонимное сообщение отправлено*

# MissingLinks
source: *🔗 No links found*
ru: *🔗 Ссылки отсутствуют*

# Month
source: {price} for 30 days
ru: {price} за 30 дней

# NewMessage
source: *✉️ New anonymous message:*
ru: *✉️ Новое анонимное сообщение:*

source: None
ru: Отсутствует

# OnlySubscriber
source: Subscribers only
ru: Только с подпиской

# OnlyTextMessage
source: *⚠️ Please send a text message only*
ru: *⚠️ Отправьте только текстовое сообщение*

# Payment
source: *💸 Payment — choose currency and payment method*
ru: *💸 Оплата — выберите валюту и платежную систему*

# ProfileInfo
source: *👁️ All important information about your profile* *ID:* {userId} *Registered:* {registeredAt} *Subscription until:* {expiresAt} *Daily message limit:* {messagesToday}/{messagesLimit}
ru: *👁️ Вся необходимая информация о вашем профиле* *ID:* {userId} *Регистрация:* {registeredAt} *Подписка до:* {expiresAt} *Лимит сообщений в сутки:* {messagesToday}/{messagesLimit}

source: Purchase
ru: Оплатить

# PurchaseSubscription
source: Buy subscription
ru: Приобрести подписку

source: *💬 Reason added*
ru: *💬 Причина добавлена*

source: *🛜 Recipient unavailable*
ru: *🛜 Получатель недоступен*

source: Remove reason
ru: Удалить причину

# Respond
source: Reply
ru: Ответить

# SelectLanguage
source: *🌐 Choose a language*
ru: *🌐 Выберите язык*

# SendNewExpiresAt
source: *🕐 Enter the new duration \(in days\) for the link*
ru: *🕐 Отправьте новую дату \(в днях\), до которой будет действовать ссылка*

# SendNewMaxUsages
source: *🔢 Enter the new max number of uses*
ru: *🔢 Отправьте новое максимальное количество использований*

# LinkLimit
source: *🔗 You have reached the link limit*
ru: *🔗 Вы достигли лимита ссылок*

# SendReason
source: *💬 Enter the reason*
ru: *💬 Отправьте причину*

# SenderAlreadyBanned
source: *🧑‍⚖️ Sender is already banned*
ru: *🧑‍⚖️ Отправитель уже заблокирован*

# SenderBanned
source: *🧑‍⚖️ Sender has been banned*
ru: *🧑‍⚖️ Отправитель заблокирован*

# SenderNotBanned
source: *🧑‍⚖️ Sender is not banned*
ru: *🧑‍⚖️ Отправитель не заблокирован*

# SenderUnbanned
source: *🧑‍⚖️ Sender has been unbanned*
ru: *🧑‍⚖️ Отправитель разблокирован*

source: Share link
ru: Поделиться ссылкой

# SubmitYourMessage
source: *✍️ Submit your anonymous message*
ru: *✍️ Отправьте ваше анонимное сообщение*

# Subscription
source: *⭐ Subscription removes limits and unlocks extra features*
ru: *⭐ Подписка снимает ограничения и открывает доступ к расширенным возможностям*

# SuccessfulPayment
source: *💸 Payment successful\. Subscription activated\!*
ru: *💸 Оплата прошла\. Подписка активирована\!*

source: Unban
ru: Разблокировать

# Week
source: {price} for 7 days
ru: {price} за 7 дней

# Year
source: {price} for 365 days
ru: {price} за 365 дней

# YourLink
source: *🔗 Your anonymous message link* > `t.me/{name}?start={link}`
ru: *🔗 Ваша ссылка для анонимных сообщений* > `t.me/{name}?start={link}`

# YourLinks
source: *Your links list*
ru: *Список ваших ссылок*

source: Edit
ru: Редактировать

source: Deactivate
ru: Деактивировать

source: Remove
ru: Удалить

source: Usage count
ru: Количество использований

source: Expiration date
ru: Срок действия
